---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.SketchFailures.CannotComputeRailingsElevation
source: html/d092614e-aea4-99cd-2073-843585d933c5.htm
---
# Autodesk.Revit.DB.BuiltInFailures.SketchFailures.CannotComputeRailingsElevation Property

Can't compute Railings Elevation Profile.

## Syntax (C#)
```csharp
public static FailureDefinitionId CannotComputeRailingsElevation { get; }
```